In [1]:
import pathlib
import pandas as pd

BASE_DIR = pathlib.Path().resolve().parent
pandas = BASE_DIR / "pandas_deep_dive"
csv1 = pandas / "survey_results_schema.csv"
csv2 = pandas / "survey_results_public.csv"

print(BASE_DIR, csv1.exists(), csv2.exists())

C:\Users\vipin\python_projects\data_analysis True True

In [16]:
people = {
    "first":["vipin", "varun", "mahesh"],
    "last":["kumar", "kumar", "singh"],
    "age": [24, 24, 27],
    "email":["vipin@gmail.com", "varun@gmail.com", "mahesh@yahoo.com"]
}
eg_df = pd.DataFrame(people)
eg_df

    first   last  age             email
0   vipin  kumar   24   vipin@gmail.com
1   varun  kumar   24   varun@gmail.com
2  mahesh  singh   27  mahesh@yahoo.com

In [6]:
# This is how we combine two rows together
eg_df['first'] + " " + eg_df["last"]

0     vipin kumar
1     varun kumar
2    mahesh singh
dtype: object

In [17]:
# Now we can add that above detail into our data frame
eg_df["full_name"] = eg_df['first'] + " " + eg_df["last"]
eg_df

    first   last  age             email     full_name
0   vipin  kumar   24   vipin@gmail.com   vipin kumar
1   varun  kumar   24   varun@gmail.com   varun kumar
2  mahesh  singh   27  mahesh@yahoo.com  mahesh singh

In [18]:
# How to drop columns
eg_df.drop(columns=["first", "last"], inplace=True)

In [19]:
# How to split a column 
eg_df["full_name"].str.split(" ")

0     [vipin, kumar]
1     [varun, kumar]
2    [mahesh, singh]
Name: full_name, dtype: object

In [20]:
# Now if you want to represent it as a 2 columns than
eg_df["full_name"].str.split(" ", expand=True)

        0      1
0   vipin  kumar
1   varun  kumar
2  mahesh  singh

In [21]:
eg_df[["first", "last"]] = eg_df["full_name"].str.split(" ", expand=True)

In [22]:
eg_df

   age             email     full_name   first   last
0   24   vipin@gmail.com   vipin kumar   vipin  kumar
1   24   varun@gmail.com   varun kumar   varun  kumar
2   27  mahesh@yahoo.com  mahesh singh  mahesh  singh

In [23]:
# How to append a single row to the dataframe?
eg_df.append({"first":"Arshita"})

C:\Users\vipin\AppData\Local\Temp\ipykernel_13616\679873994.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  eg_df.append({"first":"Arshita"})

TypeError: Can only append a dict if ignore_index=True

In [35]:
# Read the above carefully since we have not given any index so we have to state it as false and the rest pandas will take care

eg_df = eg_df.append({"first":"Arshita"}, ignore_index=True)
# The values which we are not giving they will automatically be set as Nan

C:\Users\vipin\AppData\Local\Temp\ipykernel_13616\1099914269.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  eg_df = eg_df.append({"first":"Arshita"}, ignore_index=True)

In [36]:
details = {
    "hobby": ["coding","coding", "sketching","dancing"],
    "graduation": ["BE","BE", "BCOM", "BBA"]
}
new_df = pd.DataFrame(details)

In [37]:
eg_df.append(new_df, ignore_index=True)

C:\Users\vipin\AppData\Local\Temp\ipykernel_13616\1252985553.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  eg_df.append(new_df, ignore_index=True)

    age             email     full_name    first   last      hobby graduation
0  24.0   vipin@gmail.com   vipin kumar    vipin  kumar        NaN        NaN
1  24.0   varun@gmail.com   varun kumar    varun  kumar        NaN        NaN
2  27.0  mahesh@yahoo.com  mahesh singh   mahesh  singh        NaN        NaN
3   NaN               NaN           NaN  Arshita    NaN        NaN        NaN
4   NaN               NaN           NaN      NaN    NaN     coding         BE
5   NaN               NaN           NaN      NaN    NaN     coding         BE
6   NaN               NaN           NaN      NaN    NaN  sketching       BCOM
7   NaN               NaN           NaN      NaN    NaN    dancing        BBA

In [38]:
# But this is not what we were looking we wanted to add the new data frame as a property for the exisitng data
eg_df.merge(new_df, right_index=True, left_index=True) #So we will use the merge option for this

    age             email     full_name    first   last      hobby graduation
0  24.0   vipin@gmail.com   vipin kumar    vipin  kumar     coding         BE
1  24.0   varun@gmail.com   varun kumar    varun  kumar     coding         BE
2  27.0  mahesh@yahoo.com  mahesh singh   mahesh  singh  sketching       BCOM
3   NaN               NaN           NaN  Arshita    NaN    dancing        BBA

In [39]:
# And we dont have a inplace method for setting it permanently so to do we have to assign it to dataframe
eg_df = eg_df.merge(new_df, right_index=True, left_index=True)
eg_df

    age             email     full_name    first   last      hobby graduation
0  24.0   vipin@gmail.com   vipin kumar    vipin  kumar     coding         BE
1  24.0   varun@gmail.com   varun kumar    varun  kumar     coding         BE
2  27.0  mahesh@yahoo.com  mahesh singh   mahesh  singh  sketching       BCOM
3   NaN               NaN           NaN  Arshita    NaN    dancing        BBA

In [40]:
# This is how we drop the rows using the index earlier we did with the columns 
eg_df.drop(index=3)

    age             email     full_name   first   last      hobby graduation
0  24.0   vipin@gmail.com   vipin kumar   vipin  kumar     coding         BE
1  24.0   varun@gmail.com   varun kumar   varun  kumar     coding         BE
2  27.0  mahesh@yahoo.com  mahesh singh  mahesh  singh  sketching       BCOM

In [43]:
# Remove rows on the basis of columns
eg_df.drop(index=eg_df[eg_df['last'] == "singh"].index)

    age            email    full_name    first   last    hobby graduation
0  24.0  vipin@gmail.com  vipin kumar    vipin  kumar   coding         BE
1  24.0  varun@gmail.com  varun kumar    varun  kumar   coding         BE
3   NaN              NaN          NaN  Arshita    NaN  dancing        BBA

And if you are thinking why the 3rd column came back just rememvber we haven't set the inplace=True